In [1]:
import pandas as pd
import seaborn as sns

In [2]:
#Series
s = ["Berlin","München","Hamburg","Köln","Bielefeld"]
pd.Series(s, index = s, )

Berlin          Berlin
München        München
Hamburg        Hamburg
Köln              Köln
Bielefeld    Bielefeld
dtype: object

In [3]:
#Dataframe
d = {"Farbenen":["grün","blau","gelb"],"Zahlen":[1,2,3]}
df= pd.DataFrame(d)
print(df)

  Farbenen  Zahlen
0     grün       1
1     blau       2
2     gelb       3

In [4]:
#Seaborn
print(sns.get_dataset_names())
titanic = sns.load_dataset('titanic')
print(titanic)

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'dowjones', 'exercise', 'flights', 'fmri', 'geyser', 'glue', 'healthexp', 'iris', 'mpg', 'penguins', 'planets', 'seaice', 'taxis', 'tips', 'titanic']
     survived  pclass     sex   age  sibsp  parch     fare embarked   class
0           0       3    male  22.0      1      0   7.2500        S   Third  \
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

In [5]:
print(titanic.head(5))
#Zugriff auf Spalten
print(titanic.columns)
print(titanic["adult_male"]) # es geht auch df.Alter
print(titanic[["alive","alone"]])

   survived  pclass     sex   age  sibsp  parch     fare embarked  class
0         0       3    male  22.0      1      0   7.2500        S  Third  \
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')
0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: adult_male, Length: 891, dtype: bool
    alive  alone
0      no  False
1     yes  False
2     yes   True
3     yes  False
4      no   True
..    ...    ...
886    no   True
887   yes   True
888    no  False
889   yes   True
890    no   True

[891 rows x 2 columns]

In [6]:
#Zugriff auf Zeilen
print(titanic.iloc[0])
print(titanic.iloc[0,0])
print(titanic.iloc[0,0:2])

survived                 0
pclass                   3
sex                   male
age                   22.0
sibsp                    1
parch                    0
fare                  7.25
embarked                 S
class                Third
who                    man
adult_male            True
deck                   NaN
embark_town    Southampton
alive                   no
alone                False
Name: 0, dtype: object
0
survived    0
pclass      3
Name: 0, dtype: object

In [7]:
print(titanic.loc[:,"sex"])

titanic.index = pd.Series(list(reversed(range(0,891))))  #Sets index column
titanic

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: sex, Length: 891, dtype: object

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
890,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
889,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
888,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
887,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
886,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
3,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
2,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
1,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
0,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [8]:
titanic.index = titanic["sex"]
titanic.index = pd.Series(list(reversed(range(0,891))))  #Sets index column

In [9]:
titanic.loc[[890,875,890],"class"]  #index / class

890     Third
875    Second
890     Third
Name: class, dtype: category
Categories (3, object): ['First', 'Second', 'Third']

In [10]:
print(titanic.loc[titanic["sex"]=="male"])
print(titanic.loc[titanic["embark_town"].str[:1]=="S"])

     survived  pclass   sex   age  sibsp  parch     fare embarked   class
890         0       3  male  22.0      1      0   7.2500        S   Third  \
886         0       3  male  35.0      0      0   8.0500        S   Third
885         0       3  male   NaN      0      0   8.4583        Q   Third
884         0       1  male  54.0      0      0  51.8625        S   First
883         0       3  male   2.0      3      1  21.0750        S   Third
..        ...     ...   ...   ...    ...    ...      ...      ...     ...
7           0       2  male  28.0      0      0  10.5000        S  Second
6           0       3  male  25.0      0      0   7.0500        S   Third
4           0       2  male  27.0      0      0  13.0000        S  Second
1           1       1  male  26.0      0      0  30.0000        C   First
0           0       3  male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
890    man        True  NaN  Southampton    no  False
886    man        True  NaN  Southampton    no   True
885    man        True  NaN   Queenstown    no   True
884    man        True    E  Southampton    no   True
883  child       False  NaN  Southampton    no  False
..     ...         ...  ...          ...   ...    ...
7      man        True  NaN  Southampton    no   True
6      man        True  NaN  Southampton    no   True
4      man        True  NaN  Southampton    no   True
1      man        True    C    Cherbourg   yes   True
0      man        True  NaN   Queenstown    no   True

[577 rows x 15 columns]
     survived  pclass     sex   age  sibsp  parch     fare embarked   class
890         0       3    male  22.0      1      0   7.2500        S   Third  \
888         1       3  female  26.0      0      0   7.9250        S   Third
887         1       1  female  35.0      1      0  53.1000        S   First
886         0       3    male  35.0      0      0   8.0500        S   Third
884         0       1    male  54.0      0      0  51.8625        S   First
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
7           0       2    male  28.0      0      0  10.5000        S  Second
6           0       3    male  25.0      0      0   7.0500        S   Third
4           0       2    male  27.0      0      0  13.0000        S  Second
3           1       1  female  19.0      0      0  30.0000        S   First
2           0       3  female   NaN      1      2  23.4500        S   Third

       who  adult_male deck  embark_town alive  alone
890    man        True  NaN  Southampton    no  False
888  woman       False  NaN  Southampton   yes   True
887  woman       False    C  Southampton   yes  False
886    man        True  NaN  Southampton    no   True
884    man        True    E  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
7      man        True  NaN  Southampton    no   True
6      man        True  NaN  Southampton    no   True
4      man        True  NaN  Southampton    no   True
3    woman       False    B  Southampton   yes   True
2    woman       False  NaN  Southampton    no  False

[644 rows x 15 columns]

In [11]:
titanic.loc[890:889,'sex'] = "Flag"     #Zuweisung
titanic["fuenf"] = 5                    #Zuweisung zu Spalte
titanic["neu"] = 2*titanic["age"]
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fuenf,neu
890,0,3,Flag,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,5,44.0
889,1,1,Flag,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,5,76.0
888,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,5,52.0
887,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,5,70.0
886,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,5,70.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,5,54.0
3,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,5,38.0
2,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,5,NaN
1,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,5,52.0
0,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,5,64.0

In [12]:
#Del columns
del titanic["neu"]
#Del rows from index
titanic = titanic.drop(890)
titanic = titanic.drop([887,886,885])
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fuenf
889,1,1,Flag,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,5
888,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,5
884,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True,5
883,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False,5
882,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,5
3,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,5
2,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,5
1,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,5
0,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,5

In [15]:
titanic.drop('fare', axis=1, inplace=True)
titanic

,survived,pclass,sex,age,sibsp,parch,embarked,class,who,adult_male,deck,embark_town,alive,alone
889,1,1,Flag,38.0,1,0,C,First,woman,False,C,Cherbourg,yes,False
888,1,3,female,26.0,0,0,S,Third,woman,False,NaN,Southampton,yes,True
884,0,1,male,54.0,0,0,S,First,man,True,E,Southampton,no,True
883,0,3,male,2.0,3,1,S,Third,child,False,NaN,Southampton,no,False
882,1,3,female,27.0,0,2,S,Third,woman,False,NaN,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4,0,2,male,27.0,0,0,S,Second,man,True,NaN,Southampton,no,True
3,1,1,female,19.0,0,0,S,First,woman,False,B,Southampton,yes,True
2,0,3,female,NaN,1,2,S,Third,woman,False,NaN,Southampton,no,False
1,1,1,male,26.0,0,0,C,First,man,True,C,Cherbourg,yes,True
0,0,3,male,32.0,0,0,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
df.loc[df["Alter"]>=32,'Ort'] = "Berlin"

In [17]:
#Renaming columns
titanic.columns = ['neu3','neu1', 'neu2', 'neu3','neu1', 'neu2', 'neu3','neu1', 'neu2', 'neu3','neu1', 'neu2', 'neu3','neu1']
titanic.rename (columns = {'neu3':'jaja','neu2':'nana'}, inplace = 1)
titanic.rename(columns = str.upper , inplace = True)
print(titanic)
titanic.rename(columns=lambda x: f'T1_{x}', inplace = True)
titanic

    JAJA  NEU1    NANA  JAJA  NEU1 NANA JAJA    NEU1   NANA   JAJA  NEU1
889    1     1    Flag  38.0     1    0    C   First  woman  False     C  \
888    1     3  female  26.0     0    0    S   Third  woman  False   NaN
884    0     1    male  54.0     0    0    S   First    man   True     E
883    0     3    male   2.0     3    1    S   Third  child  False   NaN
882    1     3  female  27.0     0    2    S   Third  woman  False   NaN
..   ...   ...     ...   ...   ...  ...  ...     ...    ...    ...   ...
4      0     2    male  27.0     0    0    S  Second    man   True   NaN
3      1     1  female  19.0     0    0    S   First  woman  False     B
2      0     3  female   NaN     1    2    S   Third  woman  False   NaN
1      1     1    male  26.0     0    0    C   First    man   True     C
0      0     3    male  32.0     0    0    Q   Third    man   True   NaN

            NANA JAJA   NEU1
889    Cherbourg  yes  False
888  Southampton  yes   True
884  Southampton   no   True
883  Southampton   no  False
882  Southampton  yes  False
..           ...  ...    ...
4    Southampton   no   True
3    Southampton  yes   True
2    Southampton   no  False
1      Cherbourg  yes   True
0     Queenstown   no   True

[887 rows x 14 columns]

,T1_JAJA,T1_NEU1,T1_NANA,T1_JAJA,T1_NEU1,T1_NANA,T1_JAJA,T1_NEU1,T1_NANA,T1_JAJA,T1_NEU1,T1_NANA,T1_JAJA,T1_NEU1
889,1,1,Flag,38.0,1,0,C,First,woman,False,C,Cherbourg,yes,False
888,1,3,female,26.0,0,0,S,Third,woman,False,NaN,Southampton,yes,True
884,0,1,male,54.0,0,0,S,First,man,True,E,Southampton,no,True
883,0,3,male,2.0,3,1,S,Third,child,False,NaN,Southampton,no,False
882,1,3,female,27.0,0,2,S,Third,woman,False,NaN,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4,0,2,male,27.0,0,0,S,Second,man,True,NaN,Southampton,no,True
3,1,1,female,19.0,0,0,S,First,woman,False,B,Southampton,yes,True
2,0,3,female,NaN,1,2,S,Third,woman,False,NaN,Southampton,no,False
1,1,1,male,26.0,0,0,C,First,man,True,C,Cherbourg,yes,True
0,0,3,male,32.0,0,0,Q,Third,man,True,NaN,Queenstown,no,True